src/DataProcessors/МенеджерПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>МенеджерПочты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/СтатусыИсходящегоЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыИсходящегоЭлектронногоПисьма</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоНеВсемАдресатам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВариантыВажностиЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыВажностиЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЭлектронноеПисьмоИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЭлектронноеПисьмоИсходящее</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщенияОтправкаIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторыОснований</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПредставление</Name>
					<Comment>Текстовое описание отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтработатьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейКопий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейСкрытыхКопий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИсходящегоЭлектронногоПисьма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТриггерноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТриггерныеСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиПисьма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиОтвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСкрытыхКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НепринятыеВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяВложение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПисьмаВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Письмо</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомерВоВложениях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/МенеджерПочты/Forms/Форма/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
 
&НаКлиентеНаСервереБезКонтекста
// Удаляет все элементы отбора динамического списка
//
// Параметры:
// Список  - обрабатываемый динамический список,
// ИмяПоля - имя поля компоновки, отбор по которому нужно удалить
//
Процедура УдалитьВсеЭлементыОтбораСписка(Список) 
	
	ЭлементыОтбора = Список.Отбор.Элементы;
	
	Ном = ЭлементыОтбора.Количество();
	Пока Ном > 0 Цикл
		ЭлементОтбора = ЭлементыОтбора[Ном - 1];
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЭлементыОтбора.Удалить(ЭлементОтбора);
		КонецЕсли;
		Ном = Ном - 1;
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

&НаКлиентеНаСервереБезКонтекста
// Устанавливает элемент отбор динамического списка
//
// Параметры:
// Список			- обрабатываемый динамический список,
// ИмяПоля			- имя поля компоновки, отбор по которому нужно установить,
// ВидСравнения		- вид сравнения отбора, по умолчанию - Равно,
// ПравоеЗначение 	- значение отбора
//
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено) 
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоля);	
	ЭлементОтбора.ВидСравнения   = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

&НаКлиентеНаСервереБезКонтекста
// Изменяет элемент отбора динамического списка
//
// Параметры:
// Список         - обрабатываемый динамический список,
// ИмяПоля        - имя поля компоновки, отбор по которому нужно установить,
// ВидСравнения   - вид сравнения отбора, по умолчанию - Равно,
// ПравоеЗначение - значение отбора,
// Установить     - признак необходимости установить отбор
//
Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено, ОчищатьОтбор = Истина)
	
	Если ОчищатьОтбор Тогда
		УдалитьВсеЭлементыОтбораСписка(Список);
	КонецЕсли;
	
	Если Установить Тогда
		УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()

&НаСервере
// Функция формирует описание переданного в качестве параметра письма
//
Функция СформироватьОписаниеТекущегоПисьма(ПисьмоСсылка)
	
	СтруктураОписания = Новый Структура;
	
	Начало = "
	|<html>
	|<head>  
	|<META http-equiv=Content-Type content=""text/html; charset=" + СокрЛП(ПисьмоСсылка.Кодировка) + """>
	|<META content=""MSHTML 6.00.2800.1400"" name=GENERATOR>
	|<body scroll=""auto"">";
	
	Описание = "";
	//
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ПисьмоСсылка));
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Описание;
	КонецЕсли;
	
	Если ПисьмоСсылка.ТекстHTML = "" Тогда
		
		Описание = ПисьмоСсылка.Текст;
		
		Если Найти(ПисьмоСсылка.Текст, Символы.ПС) > 0 Тогда
			Описание = СтрЗаменить(Описание, Символы.ПС, "<br>");
		КонецЕсли;
		
	Иначе
		
		Описание = ПисьмоСсылка.ТекстHTML;
		
	КонецЕсли;
	
	Конец = "
	|</body>
	|</html>";
	
	Текст = Начало + Описание + Конец;
	
	табВложения = УправлениеЭлектроннойПочтой.ПолучитьВложенияЭлектронногоПисьма(ПисьмоСсылка);
	
	Вложения.Очистить();
	Для Каждого Стр Из табВложения Цикл
		новСтр = Вложения.Добавить();
		новСтр.Ссылка         = Стр.Ссылка;
		новСтр.ИмяФайла       = Стр.ИмяФайла;
		новСтр.ИндексКартинки = Стр.ИндексКартинки;
		новСтр.Размер         = Стр.Размер;
		новСтр.Расположение   = 0;
	КонецЦикла;
	
	
	СтруктураОписания.Вставить("Тело", Текст);
	СтруктураОписания.Вставить("От", ПисьмоСсылка.ОтправительПредставление);
	СтруктураОписания.Вставить("Кому", ПисьмоСсылка.СписокПолучателейПисьма);
	СтруктураОписания.Вставить("Тема", ПисьмоСсылка.Тема);
	
	Возврат СтруктураОписания;
	
КонецФункции

&НаКлиенте
// Процедура осуществляет формирование описания письма при его выделении
//
Процедура ОбработчикОжиданияСписокПисемПриАктивизацииСтроки()
	
	ТекущееПисьмо = Элементы.СписокПисем.ТекущаяСтрока;
	
	Если ТекущееПисьмо = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОписанияПисьма = СформироватьОписаниеТекущегоПисьма(ТекущееПисьмо);
	
	ОписаниеПисьма = СтруктураОписанияПисьма.Тело;
	
	СтрОтправитель = СтруктураОписанияПисьма.От;
	СтрКому = СтруктураОписанияПисьма.Кому;
	СтрТема = СтруктураОписанияПисьма.Тема;
	
КонецПроцедуры

&НаСервере
// Функция отмечает переданное параметром письмо как рассмотренное (прочитанное)
// и выполняет сопутствующие действия
//
Функция УстановитьРассмотренностьПисьма(ПисьмоСсылка, ИдентификаторСтрокиПапки)
	
	Попытка
		ПисьмоОбъект = ПисьмоСсылка.ПолучитьОбъект();
		ПисьмоОбъект.Рассмотрено = Истина;
		ПисьмоОбъект.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	ОбновитьОтображаемоеКоличествоПисемВыбраннойПапки(ИдентификаторСтрокиПапки);
	
	Возврат Истина;
	
КонецФункции // УстановитьРассмотренностьПисьма()

&НаКлиенте
// Процедура автоматической установки рассмотренности письма
// 
Процедура АвтоустановкаРассмотренностиПисьма()
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено 
	   И ТекущиеДанные.Тип = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
	   И Не ТекущиеДанные.Рассмотрено Тогда
	   
	    Выполнено = УстановитьРассмотренностьПисьма(ТекущиеДанные.Ссылка, Элементы.ПанельУправления.ТекущаяСтрока);
		
		Если Выполнено Тогда
			// Элементы.СписокПисем.Обновить();
			Оповестить("ИзмененоЭлектронноеПисьмо", ТекущиеДанные.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // АвтоустановкаРассмотренностиПисьма()

&НаСервере
// Функция возвращает все исходящие электронные письма, которые ожидают отправки
//
Функция ПолучитьПисьмаДляОтправки()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК УчетнаяЗапись,
	|	ЭлектронноеПисьмоИсходящее.Ссылка КАК Письмо
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	|		ПО УчетныеЗаписиЭлектроннойПочты.Ссылка = ЭлектронноеПисьмоИсходящее.УчетнаяЗапись
	|ГДЕ
	|	НЕ УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления
	|	И НЕ УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты = """"
	|	И (УчетныеЗаписиЭлектроннойПочты.ВладелецУчетнойЗаписи = &Пользователь
	|			ИЛИ УчетныеЗаписиЭлектроннойПочты.ВладелецУчетнойЗаписи = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|	И УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляОтправки
	|	И ЭлектронноеПисьмоИсходящее.СтатусПисьма = ЗНАЧЕНИЕ(Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Черновик)";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	мТаблицаПисем = Запрос.Выполнить().Выгрузить();
	
	ТаблицаПисемДляОтправки.Очистить();
	
	Для Каждого СтрокаТаб ИЗ мТаблицаПисем Цикл
		НоваяСтрока = ТаблицаПисемДляОтправки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаб);
	КонецЦикла;
	
КонецФункции

&НаСервере
// Процедура добавляет адресата в одну из таблиц адресатов ("Кому", "Копии", "СкрытыеКопии")
//
Процедура ДобавитьВПараметрАдресатов(ПараметрыПисьма, ИмяПараметра, ИмяТаблицы, ПисьмоОбъект)
	
	ТабЗн = ПисьмоОбъект[ИмяТаблицы];
	Если ТабЗн.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Адресаты = Новый Массив;
	Для Каждого Стр Из ТабЗн Цикл
		Адресаты.Добавить(Новый Структура("Адрес,Представление", Стр.Адрес, Стр.Представление));
	КонецЦикла;
	
	ПараметрыПисьма.Вставить(ИмяПараметра, Адресаты);
	
КонецПроцедуры

&НаСервере
// Функция выполняет отправку исходящего электронного письма адресату
// Возвращает идентификатор электронного письма
//
Функция ВыполнитьОтправкуПисьма(ПисьмоОбъект)
	
	ПараметрыПисьма = Новый Структура;

	ДобавитьВПараметрАдресатов(ПараметрыПисьма, "Кому", "ПолучателиПисьма", ПисьмоОбъект);
	ДобавитьВПараметрАдресатов(ПараметрыПисьма, "Копии", "ПолучателиКопий", ПисьмоОбъект);
	ДобавитьВПараметрАдресатов(ПараметрыПисьма, "СкрытыеКопии", "ПолучателиСкрытыхКопий", ПисьмоОбъект);
	ПараметрыПисьма.Вставить("Тема",      ПисьмоОбъект.Тема);
	ПараметрыПисьма.Вставить("Тело",      ПисьмоОбъект.Текст);
	ПараметрыПисьма.Вставить("Кодировка", ПисьмоОбъект.Кодировка);
	ПараметрыПисьма.Вставить("Важность",  УправлениеЭлектроннойПочтой.ПолучитьВажность(ПисьмоОбъект.Важность));
	
	Если Не ПустаяСтрока(ПисьмоОбъект.ИдентификаторыОснований) Тогда
		ПараметрыПисьма.Вставить("ИдентификаторыОснований", ПисьмоОбъект.ИдентификаторыОснований);
	КонецЕсли;
	
	соотвВложения = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВерсииФайлов.ПолноеНаименование КАК ПолноеНаименование,
	|	ВерсииФайлов.Расширение,
	|	ВерсииФайлов.ФайлХранилище КАК Данные
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВерсииФайлов КАК ВерсииФайлов
	|		ПО Файлы.ТекущаяВерсия = ВерсииФайлов.Ссылка
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла";
	Запрос.УстановитьПараметр("ВладелецФайла", ПисьмоОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();


	Пока Выборка.Следующий() Цикл
		ИмяФайла = Выборка.ПолноеНаименование + ?(Выборка.Расширение = "", "", "." + Выборка.Расширение);
		соотвВложения.Вставить(ИмяФайла, Выборка.Данные.Получить());
	КонецЦикла;
	ПараметрыПисьма.Вставить("Вложения", соотвВложения);
	
	Возврат ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(ПисьмоОбъект.УчетнаяЗапись, ПараметрыПисьма);
	
КонецФункции

&НаСервере
// Функция осуществляет отправку переданного исходящего письма
// Если отправка не была выполнена - функция вернет описание возникшей ошибки
// Если отправка была успешно осуществлена - вернет пустую строку
//
Функция ВыполнитьОтправкуНаСервере(СсылкаНаПисьмо)
	
	текОбъект = СсылкаНаПисьмо.ПолучитьОбъект();
	
	Попытка
	   ИдентификаторПисьма = ВыполнитьОтправкуПисьма(текОбъект);
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
	текОбъект.ИдентификаторСообщения = ИдентификаторПисьма;
	текОбъект.СтатусПисьма = ПредопределенноеЗначение("Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Отправлено");
	текОбъект.ДатаОтправления = ТекущаяДата();
	текОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат "";

КонецФункции

&НаСервере
// Функция проверяет возможность отправки электронных писем для переданной учетной записи
//
Функция ПроверитьНаВозможностьОтпавкиПисьма(УчетнаяЗаписьСсылка) 
	
	Если НЕ УчетнаяЗаписьСсылка.ИспользоватьДляОтправки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Функция проверяет возможность создания нового исходящего письма для переданной учетной записи
//
Функция СоздатьПисьмо(УчетнаяЗаписьСсылка) 
	
	Результат = "";
	
	Если НЕ УчетнаяЗаписьСсылка.ИспользоватьДляОтправки Тогда
		Результат = "Учетная запись не предназначена для отправки писем";
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
// Функция получает количество непрочитанных писем для переданной учетной записи
//
Функция ПолучитьКоличествоНепрочитанныхПисем(УчетнаяЗапись)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭлектронноеПисьмоВходящее.Ссылка) КАК НеПрочитано
	                      |ИЗ
	                      |	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	                      |ГДЕ
	                      |	ЭлектронноеПисьмоВходящее.ПометкаУдаления = ЛОЖЬ
	                      |	И ЭлектронноеПисьмоВходящее.УчетнаяЗапись = &УчетнаяЗапись
	                      |	И ЭлектронноеПисьмоВходящее.Рассмотрено = ЛОЖЬ");
						  
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НеПрочитано;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаСервере
// Функция получает количество неотправленных писем для переданной учетной записи
//
Функция ПолучитьКоличествоНеотправленныхПисем(УчетнаяЗапись)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭлектронноеПисьмоИсходящее.Ссылка) КАК НеОтправлено
	                      |ИЗ
	                      |	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	                      |ГДЕ
	                      |	ЭлектронноеПисьмоИсходящее.ПометкаУдаления = ЛОЖЬ
	                      |	И ЭлектронноеПисьмоИсходящее.УчетнаяЗапись = &УчетнаяЗапись
	                      |	И ЭлектронноеПисьмоИсходящее.СтатусПисьма = ЗНАЧЕНИЕ(Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Черновик)");
						  
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НеОтправлено;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаСервере
// Процедура обновляет количество непрочитанных и неотправленных писем в наименовании
// всех папок дерева учетных записей
//
Процедура ОбновитьОтображаемоеКоличествоПисемВсехПапок()
	
	ЭлементыДерева = ДеревоУчетныхЗаписей.ПолучитьЭлементы();
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		ВложенныеЭлементы = ЭлементДерева.ПолучитьЭлементы();
		
		Для Каждого ВложенныйЭлемент Из ВложенныеЭлементы Цикл
			
			ОбновитьОтображаемоеКоличествоПисемВыбраннойПапки(ВложенныйЭлемент);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура обновляет количество непрочитанных и неотправленных писем в наименовании
// переданной строки дерева учетных записей
//
Процедура ОбновитьОтображаемоеКоличествоПисемВыбраннойПапки(ИдентификаторСтроки)
	
	Если ТипЗнч(ИдентификаторСтроки) = Тип("Число") Тогда
		ВыбраннаяПапка = ДеревоУчетныхЗаписей.НайтиПоИдентификатору(ИдентификаторСтроки);
	ИначеЕсли ТипЗнч(ИдентификаторСтроки) = Тип("ДанныеФормыЭлементДерева") Тогда
		ВыбраннаяПапка = ИдентификаторСтроки;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Найти(ВыбраннаяПапка.Наименование, "Входящие") = 1 Тогда
		
		НеПрочитано = ПолучитьКоличествоНепрочитанныхПисем(ВыбраннаяПапка.УчетнаяЗапись);
		ВыбраннаяПапка.Наименование = "Входящие" + ?(НеПрочитано > 0, " (" + НеПрочитано + ")", "");
		ВыбраннаяПапка.ЖирныйШрифт  = (НеПрочитано > 0);
		
	ИначеЕсли Найти(ВыбраннаяПапка.Наименование, "Исходящие") = 1 Тогда
		
		НеОтправлено = ПолучитьКоличествоНеотправленныхПисем(ВыбраннаяПапка.УчетнаяЗапись);
		ВыбраннаяПапка.Наименование = "Исходящие" + ?(НеОтправлено > 0, " (" + НеОтправлено + ")", "");
		ВыбраннаяПапка.ЖирныйШрифт  = (НеОтправлено > 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура обновляет список писем в соответствии с выбранной папкой
//
Процедура ОбновитьСписокПисем()
	
	ОбновитьСписокПисемНаСервере(Элементы.ПанельУправления.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
// Процедура обновляет список писем в соответствии с выбранной папкой
//
Процедура ОбновитьСписокПисемНаСервере(ИдентификаторТекущейПапки)
	
	ТекущаяПапкаПисем = ДеревоУчетныхЗаписей.НайтиПоИдентификатору(ИдентификаторТекущейПапки);
	
	Если ТекущаяПапкаПисем = Неопределено Тогда 
		ИзменитьЭлементОтбораСписка(СписокПисем, "УчетнаяЗапись", Неопределено, Истина,,);
		Возврат; 
	КонецЕсли;
	
	Родитель = ТекущаяПапкаПисем.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		
		ИзменитьЭлементОтбораСписка(СписокПисем, "УчетнаяЗапись", Неопределено, Истина,,);
		
	Иначе
		
		ИзменитьЭлементОтбораСписка(СписокПисем, "УчетнаяЗапись", ТекущаяПапкаПисем.УчетнаяЗапись, Истина,,);
		
		Если Найти(ТекущаяПапкаПисем.Наименование, "Входящие") = 1 Тогда
			
			ИзменитьЭлементОтбораСписка(СписокПисем, "ТипПисьма", 0, Истина,,Ложь);
			ИзменитьЭлементОтбораСписка(СписокПисем, "ПометкаУдаления", Ложь, Истина,,Ложь);
			
			Если ОтборСпискаПисем = "Обработанные" ИЛИ ОтборСпискаПисем = "Необработанные" Тогда
				ИзменитьЭлементОтбораСписка(СписокПисем, "Обработано", ОтборСпискаПисем = "Обработанные", Истина, , Ложь);
			ИначеЕсли ОтборСпискаПисем = "Непрочитанные" Тогда
				ИзменитьЭлементОтбораСписка(СписокПисем, "Рассмотрено", Ложь, Истина, , Ложь);
			КонецЕсли;
			
			ОбновитьОтображаемоеКоличествоПисемВыбраннойПапки(ТекущаяПапкаПисем);
			
		ИначеЕсли Найти(ТекущаяПапкаПисем.Наименование, "Исходящие") = 1 Тогда
			
			ИзменитьЭлементОтбораСписка(СписокПисем, "ТипПисьма", 1, Истина,,Ложь);
			ИзменитьЭлементОтбораСписка(СписокПисем, "Статус", 0, Истина,,Ложь);
			ИзменитьЭлементОтбораСписка(СписокПисем, "ПометкаУдаления", Ложь, Истина,,Ложь);
			
			ОбновитьОтображаемоеКоличествоПисемВыбраннойПапки(ТекущаяПапкаПисем);
			
		ИначеЕсли ТекущаяПапкаПисем.Наименование = "Отправленные" Тогда
			
			ИзменитьЭлементОтбораСписка(СписокПисем, "ТипПисьма", 1, Истина,,Ложь);
			ИзменитьЭлементОтбораСписка(СписокПисем, "Статус", 1, Истина,,Ложь);
			ИзменитьЭлементОтбораСписка(СписокПисем, "ПометкаУдаления", Ложь, Истина,,Ложь);
			
		ИначеЕсли ТекущаяПапкаПисем.Наименование = "Удаленные" Тогда
			
			ИзменитьЭлементОтбораСписка(СписокПисем, "ПометкаУдаления", Истина, Истина,,Ложь);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьСписокПисемНаСервере()

&НаСервере
// Функция осуществляет установку или снятие пометки удаления электронных писем
//
Функция УстановитьПометкуНаУдаление(МассивСтрокПисем)
	
	ВыполненоУспешно = Ложь;
	Для Каждого СтрокаПисьма Из МассивСтрокПисем Цикл
		
		Попытка
			
			ПисьмоОбъект = СтрокаПисьма.Ссылка.ПолучитьОбъект();
			ПисьмоОбъект.ПометкаУдаления = НЕ ПисьмоОбъект.ПометкаУдаления;
			ПисьмоОбъект.Записать();
			
			// Функция вернет "Истина" если хотя бы одно письмо обработано успешно
			ВыполненоУспешно = Истина;
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ВыполненоУспешно;
	
КонецФункции

&НаСервереБезКонтекста
// Процедура производит установку важности электронного письма
//
Процедура ИзменитьВажностьПисьмаНаСервере(Знач МассивПисем, Параметр)
	
	Если Параметр = 2 Тогда
		НоваяВажностьПисьма = Перечисления.ВариантыВажностиЗадачи.Высокая;
	ИначеЕсли Параметр = 0 Тогда
		НоваяВажностьПисьма = Перечисления.ВариантыВажностиЗадачи.Низкая;
	Иначе
		НоваяВажностьПисьма = Перечисления.ВариантыВажностиЗадачи.Обычная;
	КонецЕсли;
	
	Для Каждого ПисьмоСсылка Из МассивПисем Цикл
		
		Если ПисьмоСсылка.Важность = НоваяВажностьПисьма Тогда
			Продолжить;
		КонецЕсли;
		
		ПисьмоОбъект = ПисьмоСсылка.ПолучитьОбъект();
		ПисьмоОбъект.Важность = НоваяВажностьПисьма;
		ПисьмоОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура производит сопутствующие действия при изменении важности электронного письма
//
Процедура ИзменитьВажностьПисьма(Параметр)
	
	ИзменитьВажностьПисьмаНаСервере(Элементы.СписокПисем.ВыделенныеСтроки, Параметр);
	
	ОповеститьОбИзменении(ПредопределенноеЗначение("Документ.ЭлектронноеПисьмоВходящее.ПустаяСсылка"));
	ОповеститьОбИзменении(ПредопределенноеЗначение("Документ.ЭлектронноеПисьмоИсходящее.ПустаяСсылка"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
		
	ТЗУчетныеЗаписи = Справочники.УчетныеЗаписиЭлектроннойПочты.ВернутьУчетныеЗаписиЭлектроннойПочтыОбщиеИЛичные(ПараметрыСеанса.ТекущийПользователь, Ложь, Ложь, Ложь, Ложь);	
	
	Дерево = РеквизитФормыВЗначение("ДеревоУчетныхЗаписей");
	Дерево.Строки.Очистить();
	
	ЭтаФорма.флОтказ = Истина;
	
	Для Каждого СтрокаТЗ Из ТЗУчетныеЗаписи Цикл

		ЭтаФорма.флОтказ = Ложь;
		
		СтрокаУЗ = Дерево.Строки.Добавить();
		
		СтрокаУЗ.Наименование	= СтрокаТЗ.Наименование;
		СтрокаУЗ.УчетнаяЗапись	= СтрокаТЗ.Ссылка;
		СтрокаУЗ.Картинка		= 4;
		
		СтрокаВходящие = СтрокаУЗ.Строки.Добавить();
		НеПрочитано = ПолучитьКоличествоНепрочитанныхПисем(СтрокаУЗ.УчетнаяЗапись);
		СтрокаВходящие.Наименование = "Входящие" + ?(НеПрочитано > 0, " (" + НеПрочитано + ")", "");
		СтрокаВходящие.ЖирныйШрифт = (НеПрочитано > 0);
		СтрокаВходящие.Картинка = 0;
		СтрокаВходящие.УчетнаяЗапись = СтрокаУЗ.УчетнаяЗапись;
		
		СтрокаИсходящие	= СтрокаУЗ.Строки.Добавить();
		НеОтправлено = ПолучитьКоличествоНеотправленныхПисем(СтрокаУЗ.УчетнаяЗапись);
		СтрокаИсходящие.Наименование = "Исходящие" + ?(НеОтправлено > 0, " (" + НеОтправлено + ")", "");
		СтрокаИсходящие.ЖирныйШрифт = (НеОтправлено > 0);
		СтрокаИсходящие.Картинка = 1;
		СтрокаИсходящие.УчетнаяЗапись = СтрокаУЗ.УчетнаяЗапись;
		
		СтрокаОтправленные = СтрокаУЗ.Строки.Добавить();
		СтрокаОтправленные.Наименование = "Отправленные";
		СтрокаОтправленные.ЖирныйШрифт = Ложь;
		СтрокаОтправленные.Картинка = 2;
		СтрокаОтправленные.УчетнаяЗапись = СтрокаУЗ.УчетнаяЗапись;
		
		// СтрокаЧерновики	= СтрокаУЗ.Строки.Добавить();
		// СтрокаЧерновики.Наименование = "Черновики";
		// СтрокаЧерновики.Картинка = 5;
		// СтрокаЧерновики.УчетнаяЗапись = СтрокаУЗ.УчетнаяЗапись;
		
		СтрокаУдаленные = СтрокаУЗ.Строки.Добавить();
		СтрокаУдаленные.Наименование = "Удаленные";
		СтрокаУдаленные.ЖирныйШрифт = Ложь;
		СтрокаУдаленные.Картинка = 3;
		СтрокаУдаленные.УчетнаяЗапись = СтрокаУЗ.УчетнаяЗапись;
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(Дерево, ДеревоУчетныхЗаписей);
	
    ОтборСпискаПисем = Элементы.ПолеОтбора.СписокВыбора[3];	// все письма
	
КонецПроцедуры

&НаКлиенте
// Обработчик оповещения формы
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановленФлагОбработано" Тогда
		
		Элементы.СписокПисем.Обновить();
		ОбработчикОжиданияСписокПисемПриАктивизацииСтроки();
		
	ИначеЕсли ИмяСобытия = "ИзмененоЭлектронноеПисьмо"
		  ИЛИ ИмяСобытия = "ВыполненаОтправкаПисьма" Тогда
		  
		Элементы.СписокПисем.Обновить();  
		ОбновитьОтображаемоеКоличествоПисемВсехПапок();
		ОбработчикОжиданияСписокПисемПриАктивизацииСтроки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик события формы "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.флОтказ тогда 
		Отказ = Истина;
		ПоказатьПредупреждение(,"У пользователя нет ни одной учетной записи электронной почты.", 10);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
// Обработчик команды "ОтветитьВсем"
//
Процедура ОтветитьВсем(Команда)
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	ТекущиеДанныеДерева = Элементы.ПанельУправления.ТекущиеДанные;
	Если НЕ ПроверитьНаВозможностьОтпавкиПисьма(ТекущиеДанныеДерева.УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Учетная запись не предназначена для отправки писем");
		Возврат;
	КонецЕсли;
	
	Основание = Новый Структура("Предмет, Команда", ТекущиеДанные.Ссылка, "ОтветитьВсем");
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", Основание);
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
// Обработчик команды "Переслать"
//
Процедура Переслать(Команда)
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеДерева = Элементы.ПанельУправления.ТекущиеДанные;
	Если НЕ ПроверитьНаВозможностьОтпавкиПисьма(ТекущиеДанныеДерева.УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Учетная запись не предназначена для отправки писем");
		Возврат;
	КонецЕсли;
	
	Основание = Новый Структура("Предмет, Команда", ТекущиеДанные.Ссылка, "Переслать");
	
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения, ПереноситьВложения", Основание, Истина);
	
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
// Обработчик создания нового исходящего письма
//
Процедура Создать(Команда)
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Результат = "";
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли; 		
	
	Результат = СоздатьПисьмо(ТекущиеДанные.УчетнаяЗапись); 	
	
	Если Результат = "" Тогда
		
		ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", Новый Структура("ТекущаяУчетнаяЗапись", ТекущиеДанные.УчетнаяЗапись));
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик команды "ПолучитьПочту"
//
Процедура ПолучитьПочту(Команда)
	
	УправлениеЭлектроннойПочтойКлиент.ЗагрузитьПочтуПользователя(Элементы.СписокПисем);
	ОбновитьОтображаемоеКоличествоПисемВсехПапок();
	
	Оповестить("ПолученаЭлектроннаяПочта");
		
КонецПроцедуры

&НаКлиенте
// Обработчик команды "ОтправитьПочту"
//
Процедура ОтправитьПочту(Команда)
	
	ПолучитьПисьмаДляОтправки();
	
	Для Каждого СтрокаНеОтправленногоПисьма ИЗ ТаблицаПисемДляОтправки Цикл
		ВыполнитьОтправкуНаСервере(СтрокаНеОтправленногоПисьма.Письмо);
	КонецЦикла;
	
	Элементы.СписокПисем.Обновить();
	ОбновитьОтображаемоеКоличествоПисемВсехПапок();
	
КонецПроцедуры

&НаКлиенте
// Обработчик команды "Ответить"
//
Процедура Ответить(Команда)
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	ТекущиеДанныеДерева = Элементы.ПанельУправления.ТекущиеДанные;
	Если НЕ ПроверитьНаВозможностьОтпавкиПисьма(ТекущиеДанныеДерева.УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Учетная запись не предназначена для отправки писем");
		Возврат;
	КонецЕсли;
	
	Основание = Новый Структура("Предмет, Команда", ТекущиеДанные.Ссылка, "Ответить");
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", Основание);
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкаУдаления(Команда)
	
	МассивСтрок = Элементы.СписокПисем.ВыделенныеСтроки;
	
	Выполнено = УстановитьПометкуНаУдаление(МассивСтрок);
	
	Если Выполнено Тогда
		
		Оповестить("ИзмененоЭлектронноеПисьмо", Элементы.СписокПисем.ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура устанавливает высокую важность выделенным в списке писем письмам 
//
Процедура ВысокаяВажность(Команда)
	
	ИзменитьВажностьПисьма(2);
	
КонецПроцедуры

&НаКлиенте
// Процедура устанавливает низкую важность выделенным в списке писем письмам 
//
Процедура НизкаяВажность(Команда)
	
	ИзменитьВажностьПисьма(0);
	
КонецПроцедуры

&НаКлиенте
// Процедура устанавливает обычную важность выделенным в списке писем письмам 
//
Процедура ОбычнаяВажность(Команда)
	
	ИзменитьВажностьПисьма(1);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ОСТАЛЬНЫХ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ

&НаКлиенте
// Процедура осуществляет необходимые действия при изменении папки электронных писем
//
Процедура ПанельУправленияПриАктивизацииСтроки(Элемент)
	
	ОписаниеПисьма = "
	|<html>
	|<head>  
	|<META http-equiv=Content-Type content=""text/html; charset=utf-8"">
	|<META content=""MSHTML 6.00.2800.1400"" name=GENERATOR>
	|<body scroll=""auto"">
	|</body>
	|</html>";
	
	СтрОтправитель = "";
	СтрКому = "";
	СтрТема = "";
	Вложения.Очистить();
		
	ОбновитьСписокПисем();
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняет необходимые действия при выделении электронного письма в списке писем
//
Процедура СписокПисемПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияСписокПисемПриАктивизацииСтроки",0.1,Истина);
	
	Если ОтборСпискаПисем <> "Непрочитанные" Тогда
		ПодключитьОбработчикОжидания("АвтоустановкаРассмотренностиПисьма", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняет сопутствующие действия перед открытием формы выбранного электронного письма
//
Процедура СписокПисемВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("АвтоустановкаРассмотренностиПисьма");
	
	АвтоустановкаРассмотренностиПисьма();
	
КонецПроцедуры

&НаКлиенте
// Процедура перестраивает список писем в соответствии с установленным отбором
//
Процедура ПолеОтбораПриИзменении(Элемент)
	
	ОбновитьСписокПисем();	
	
КонецПроцедуры

&НаКлиенте
// Обработчик события "ПриНажатии" элемента формы "ОписаниеПисьмаHTML"
//
Процедура ОписаниеПисьмаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.ТекущийЭлемент = Элемент;
	
КонецПроцедуры

#КонецОбласти
